In [2]:
import numpy as np
import pandas as pd

##### DATAFRAMES and how to get general information about the data

In [13]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],  columns = ["A", "B", "C"], index=["X", "Y", "Z"])
print(df)
df.index
df.columns
df.info()
df.describe()
df.shape

   A  B  C
X  1  2  3
Y  4  5  6
Z  7  8  9
<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, X to Z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

(3, 3)

###### LOADING IN DATAFRAMES FROM FILES (FILES KA DATA PANDAS KI FILES ME KAISE IMPORT KARTE HAI)

In [ ]:
coffee = pd.read_csv("coffe.csv")
coffee.head()
# coffee.tail()
# coffee.info()
# coffee.describe()
# coffee.shape

# agar kisi link se data lena hai to pd.read_csv("link") bas us web me data sahi format me hona chahiye

         Day  coffe type   Units sold
0     Monday    Espresso           25
1     Monday       latte           10
2    Tuesday    Espresso           25
3    Tuesday       latte           10
4  Wednesday    Espresso           25

In [30]:
# titaniclist = pd.read_parquet("titanic.parquet", engine="pyarrow")
# or
titaniclist = pd.read_parquet("titanic.parquet", engine="fastparquet")
titaniclist.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

###### DATA KO KAISE FILTER KIYA JATA HAI

In [ ]:
# coffee.loc[0]  # first row
# coffee.loc[2]  # third row


# data of any range
# coffee.loc[0:9]  # first 10 rows
coffee.loc[5:9, ["Day", " Units sold"]] # 6th to 10th rows

         Day   Units sold
5  Wednesday           10
6   Thursday           25
7   Thursday           10
8     Friday           25
9     Friday           10

#### same cheez index ke number ko use karke

In [ ]:
coffee.iloc[5:9, [0,2]] # 6th to 10th rows    loc ki jagah iloc use karte hai to index ke number se kaam karta hai

         Day   Units sold
5  Wednesday           10
6   Thursday           25
7   Thursday           10
8     Friday           25

In [50]:
coffee.index = coffee["Day"]

#### another mehod to filter

In [52]:
coffee.loc["Monday":"Wednesday","Day":" Units sold"]

                 Day  coffe type   Units sold
Day
Monday        Monday    Espresso           25
Monday        Monday       latte           10
Tuesday      Tuesday    Espresso           25
Tuesday      Tuesday       latte           10
Wednesday  Wednesday    Espresso           25
Wednesday  Wednesday       latte           10

##### kisi specific location pe ky dtaa hai use nikalne ke liye iat ya fir at ka use kiya jata hai

In [66]:
coffee.iat[1, 0]

'Monday'

In [70]:
for index, row in coffee.iterrows():
    print(index)
    # print(row[' Units sold'])
    print(row)
    print("\n\n\n\n")

Monday
Day               Monday
 coffe type     Espresso
 Units sold           25
Name: Monday, dtype: object





Monday
Day            Monday
 coffe type     latte
 Units sold        10
Name: Monday, dtype: object





Tuesday
Day              Tuesday
 coffe type     Espresso
 Units sold           25
Name: Tuesday, dtype: object





Tuesday
Day            Tuesday
 coffe type      latte
 Units sold         10
Name: Tuesday, dtype: object





Wednesday
Day            Wednesday
 coffe type     Espresso
 Units sold           25
Name: Wednesday, dtype: object





Wednesday
Day            Wednesday
 coffe type        latte
 Units sold           10
Name: Wednesday, dtype: object





Thursday
Day             Thursday
 coffe type     Espresso
 Units sold           25
Name: Thursday, dtype: object





Thursday
Day            Thursday
 coffe type       latte
 Units sold          10
Name: Thursday, dtype: object





Friday
Day               Friday
 coffe type     Espresso
 Units sold           25
Name: Friday, dtype: object





Friday
Day            Friday
 coffe type     latte
 Units sold        10
Name: Friday, dtype: object





Saturday
Day             Saturday
 coffe type     Espresso
 Units sold           25
Name: Saturday, dtype: object





Saturday
Day            Saturday
 coffe type       latte
 Units sold          10
Name: Saturday, dtype: object





Sunday
Day               Sunday
 coffe type     Espresso
 Units sold           25
Name: Sunday, dtype: object





Sunday
Day            Sunday
 coffe type     latte
 Units sold        10
Name: Sunday, dtype: object

##### Adding or removing any column

In [86]:
coffee["price"] = 4.99
coffee

                 Day  coffe type   Units sold  price  new price
Day
Monday        Monday    Espresso           25   4.99       5.99
Monday        Monday       latte           10   4.99       5.99
Tuesday      Tuesday    Espresso           25   4.99       5.99
Tuesday      Tuesday       latte           10   4.99       5.99
Wednesday  Wednesday    Espresso           25   4.99       5.99
Wednesday  Wednesday       latte           10   4.99       5.99
Thursday    Thursday    Espresso           25   4.99       5.99
Thursday    Thursday       latte           10   4.99       5.99
Friday        Friday    Espresso           25   4.99       5.99
Friday        Friday       latte           10   4.99       5.99
Saturday    Saturday    Espresso           25   4.99       5.99
Saturday    Saturday       latte           10   4.99       5.99
Sunday        Sunday    Espresso           25   4.99       5.99
Sunday        Sunday       latte           10   4.99       5.99

In [90]:
coffee.columns = coffee.columns.str.strip()  # remove spaces around column names
coffee["coffe type"] = coffee["coffe type"].str.strip()  # remove spaces in values



coffee["new price"] = np.where(coffee["coffe type"] == "Espresso", 3.99, 5.99)
print(coffee[["Day", "coffe type", "new price"]])

                 Day coffe type  new price
Day
Monday        Monday   Espresso       3.99
Monday        Monday      latte       5.99
Tuesday      Tuesday   Espresso       3.99
Tuesday      Tuesday      latte       5.99
Wednesday  Wednesday   Espresso       3.99
Wednesday  Wednesday      latte       5.99
Thursday    Thursday   Espresso       3.99
Thursday    Thursday      latte       5.99
Friday        Friday   Espresso       3.99
Friday        Friday      latte       5.99
Saturday    Saturday   Espresso       3.99
Saturday    Saturday      latte       5.99
Sunday        Sunday   Espresso       3.99
Sunday        Sunday      latte       5.99

In [95]:
coffee['revenue'] = coffee['Units sold'] * coffee['new price']
coffee.head()

                 Day coffe type  Units sold  price  new price  revenue
Day
Monday        Monday   Espresso          25   4.99       3.99    99.75
Monday        Monday      latte          10   4.99       5.99    59.90
Tuesday      Tuesday   Espresso          25   4.99       3.99    99.75
Tuesday      Tuesday      latte          10   4.99       5.99    59.90
Wednesday  Wednesday   Espresso          25   4.99       3.99    99.75

AttributeError: 'NoneType' object has no attribute 'rename'